# Hari 3 â€“ Reshaping Data

## Pivoting Data

In [1]:
import pandas as pd
data = {
    'foo' : ['one']*3 + ['two']*3,
    'bar' : ['A', 'B', 'C', 'A', 'B', 'C'],
    'baz' : [1, 2, 3, 4, 5, 6],
    'zoo' : ['x', 'y', 'z', 'q', 'w', 't']
}
df = pd.DataFrame(data)
print(df)

   foo bar  baz zoo
0  one   A    1   x
1  one   B    2   y
2  one   C    3   z
3  two   A    4   q
4  two   B    5   w
5  two   C    6   t

In [2]:
# using pivot
pivot_df = pd.pivot(df, index='foo', columns='bar', values='baz')

print(pivot_df)

bar  A  B  C
foo
one  1  2  3
two  4  5  6

In [3]:
#using pivot_table
pivot_table_df= pd.pivot_table(df, index='foo', columns='bar', values='baz', aggfunc='sum')

print(pivot_table_df)

bar  A  B  C
foo
one  1  2  3
two  4  5  6

## Melting Data

In [4]:
# Membuat datafame sederhana
  
# importing pandas as pd 
import pandas as pd 
  
# membuat dataframe
df = pd.DataFrame({'Name': {0: 'John', 1: 'Bob', 2: 'Shiela'}, 
                   'Course': {0: 'Masters', 1: 'Graduate', 2: 'Graduate'}, 
                   'Age': {0: 27, 1: 23, 2: 21}}) 
df

     Name    Course  Age
0    John   Masters   27
1     Bob  Graduate   23
2  Shiela  Graduate   21

In [5]:
# Unpivot table 
pd.melt(df, id_vars =['Name'], value_vars =['Course', 'Age'])

     Name variable     value
0    John   Course   Masters
1     Bob   Course  Graduate
2  Shiela   Course  Graduate
3    John      Age        27
4     Bob      Age        23
5  Shiela      Age        21